{
  "_name_or_path": "microsoft/deberta-large",
  "add_prompt_layer": 12,
  "architectures": [
    "DebertaPromptTuning"
  ],
  "attention_probs_dropout_prob": 0.1,
  "finetuning_task": "rte",
  "generator_type": "NPG",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "layer_norm_eps": 1e-07,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "num_prompt_tokens": 5,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 1024,
  "pos_att_type": [
    "c2p",
    "p2c"
  ],
  "position_biased_input": false,
  "proj_down_size": 256,
  "relative_attention": true,
  "transformers_version": "4.6.1",
  "type_vocab_size": 0,
  "vocab_size": 50265
}
