{
  "_name_or_path": "roberta-large",
  "add_prompt_layer": 12,
  "architectures": [
    "RobertaPromptTuning"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "eos_token_id": 2,
  "finetuning_task": "rte",
  "generator_type": "NPG",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "num_prompt_tokens": 5,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "proj_down_size": 128,
  "transformers_version": "4.6.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
